# Pivot tables
* A pivot table is itself a DataFrame, which compares two groups on some shared columns, thus:
  1. the rows represent one variable that you're interested in
  2. the columns another variables, and 
  3. the cell content is some *aggregate* value of a third column 
* Often a pivot table includes marginal values as well, which are comparisons across multiple groups (more in a minute)

In [1]:
# Here we have the Times Higher Education World University Ranking dataset
import pandas as pd
import numpy as np
df = pd.read_csv('datasets/cwurData.csv')
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [ ]:
# Let's say we want to create a new column called *Rank_Level*, where institutions with world ranking 1-100 are
# categorized as *first tier* and those with world ranking 101 - 200 are *second tier*, ranking 201 - 300 are
# *third tier*, after 301 is *other* top universities.

# You do that now, please.

In [2]:
#Put interesting student solution here.
def set_rank(row):
    if row["world_rank"] <= 100:
        row["Rank_Level"]="first tier"
    elif row["world_rank"] <= 200:
        row["Rank_Level"]="second tier"
    elif row["world_rank"] <= 300:
        row["Rank_Level"]="third tier"
    else:
        row["Rank_Level"]="other top universities"
    return row

df=df.apply(set_rank, axis=1)
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,Rank_Level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,first tier
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,first tier
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,first tier
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,first tier
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,first tier

* Let's pivot! We need two columns, let's say the *country* and our *rank level* these will become our new rows (index)/columns (labels)
* Now we need one column of interest for the cell value, let's use the *score*
* Then we need on aggregation function, which we'll apply to *score* let's use `np.mean`

* essentially this means we're comparing two groups, "Countries" vs. "Rank Level" with respect to score using an average. Think for a moment how you might tackle this with group by

In [4]:
df.pivot_table(values='score', 
               index='country', 
               columns='Rank_Level', 
               aggfunc=[np.mean])

                           mean
Rank_Level           first tier other top universities second tier third tier
country
Argentina                   NaN              44.672857         NaN        NaN
Australia             47.942500              44.645750   49.242500  47.285000
Austria                     NaN              44.864286         NaN  47.066667
Belgium               51.875000              45.081000   49.084000  46.746667
Brazil                      NaN              44.499706   49.565000        NaN
Bulgaria                    NaN              44.335000         NaN        NaN
Canada                53.633846              44.760541   49.218182  46.826364
Chile                       NaN              44.767500         NaN        NaN
China                 53.592500              44.564267   47.868000  46.926250
Colombia                    NaN              44.432500         NaN        NaN
Croatia                     NaN              44.770000         NaN        NaN
Cyprus                      NaN              44.210000         NaN        NaN
Czech Republic              NaN              44.587778         NaN  46.320000
Denmark               49.180000              45.177500   48.965000        NaN
Egypt                       NaN              44.230000         NaN        NaN
Estonia                     NaN              44.810000         NaN        NaN
Finland               44.415000              45.062500   50.400000        NaN
France                51.914444              44.609028   48.888571  47.125833
Germany               49.153636              44.978305   48.695556  46.910370
Greece                      NaN              44.854286         NaN        NaN
Hong Kong                   NaN              45.284286   48.625000  47.100000
Hungary                     NaN              44.603333         NaN        NaN
Iceland                     NaN              44.980000         NaN        NaN
India                       NaN              44.713226         NaN        NaN
Iran                        NaN              44.270000         NaN        NaN
Ireland                     NaN              44.542500   47.845000  46.780000
Israel                56.307143              45.013333   50.005000        NaN
Italy                 48.736667              44.964177   48.618000  46.861111
Japan                 58.812692              44.641583   49.157143  46.546667
Lebanon                     NaN              44.655000         NaN        NaN
Lithuania                   NaN              44.355000         NaN        NaN
Malaysia                    NaN              45.008333         NaN        NaN
Mexico                      NaN              45.102500         NaN        NaN
Netherlands           48.378333              45.163333   49.963636  46.656667
New Zealand                 NaN              44.832000         NaN  46.515000
Norway                47.056667              44.950000   50.700000  46.446667
Poland                      NaN              44.497222         NaN        NaN
Portugal                    NaN              44.717273         NaN  46.480000
Puerto Rico                 NaN              44.175000         NaN        NaN
Romania                     NaN              44.133333         NaN        NaN
Russia                51.846667              44.462500         NaN  46.520000
Saudi Arabia                NaN              44.511250         NaN        NaN
Serbia                      NaN              44.420000         NaN        NaN
Singapore             50.720000                    NaN   49.320000        NaN
Slovak Republic             NaN              44.490000         NaN        NaN
Slovenia                    NaN              44.615000         NaN        NaN
South Africa                NaN              45.246667   49.575000  46.680000
South Korea           55.990000              44.805714   49.136667  47.490000
Spain                       NaN              44.724730   49.310000  46.675000
Sweden                50.672000              45.272500   49.306250  46.456667
Switzerland           54.005000              44.625000   48.184000  47.930000
Taiwan                54.210000              44.476667         NaN  47.065000
Thailand                    NaN              44.830000         NaN  46.550000
Turkey                      NaN              44.481000         NaN        NaN
USA                   61.066726              44.871718   49.069524  46.818333
Uganda                      NaN              44.280000         NaN        NaN
United Arab Emirates        NaN              44.220000         NaN        NaN
United Kingdom        63.937931              44.881299   48.957500  46.862273
Uruguay                     NaN              44.255000         NaN        NaN

* we notice that there are some NaN values, e.g. Argentia has only observations in the "Other Top Unversities" category

* pivot tables aren't limited to one aggregation! We could use multiple functions and see those results with heirarchical column labels

In [5]:
df.pivot_table(values='score', index='country', columns='Rank_Level', 
               aggfunc=[np.mean, np.max]).head()

                 mean                                                \
Rank_Level first tier other top universities second tier third tier
country
Argentina         NaN              44.672857         NaN        NaN
Australia     47.9425              44.645750     49.2425  47.285000
Austria           NaN              44.864286         NaN  47.066667
Belgium       51.8750              45.081000     49.0840  46.746667
Brazil            NaN              44.499706     49.5650        NaN

                 amax
Rank_Level first tier other top universities second tier third tier
country
Argentina         NaN                  45.66         NaN        NaN
Australia       51.61                  45.97       50.40      47.47
Austria           NaN                  46.29         NaN      47.78
Belgium         52.03                  46.21       49.73      47.14
Brazil            NaN                  46.08       49.82        NaN

In [6]:
# we can also provide those marginal values
df.pivot_table(values='score', 
               index='country', 
               columns='Rank_Level', 
               aggfunc=[np.mean, np.std], 
               margins=True).head()

                 mean                                                \
Rank_Level first tier other top universities second tier third tier
country
Argentina         NaN              44.672857         NaN        NaN
Australia     47.9425              44.645750     49.2425  47.285000
Austria           NaN              44.864286         NaN  47.066667
Belgium       51.8750              45.081000     49.0840  46.746667
Brazil            NaN              44.499706     49.5650        NaN

                             std                                     \
Rank_Level        All first tier other top universities second tier
country
Argentina   44.672857        NaN               0.599130         NaN
Australia   45.825517   3.798397               0.386542    0.820640
Austria     45.139583        NaN               0.590191         NaN
Belgium     47.011000   0.219203               0.786419    0.829958
Brazil      44.781111        NaN               0.490476    0.360624


Rank_Level third tier       All
country
Argentina         NaN  0.599130
Australia    0.261630  2.297206
Austria      0.695725  0.947929
Belgium      0.481283  2.461225
Brazil            NaN  1.270909

In [7]:
# A pivot table is just a multi-level dataframe
new_df=df.pivot_table(values='score', index='country', columns='Rank_Level', aggfunc=[np.mean, np.max], 
               margins=True)
# Now let's look at the index
print(new_df.index)
# And let's look at the columns
print(new_df.columns)

Index(['Argentina', 'Australia', 'Austria', 'Belgium', 'Brazil', 'Bulgaria',
       'Canada', 'Chile', 'China', 'Colombia', 'Croatia', 'Cyprus',
       'Czech Republic', 'Denmark', 'Egypt', 'Estonia', 'Finland', 'France',
       'Germany', 'Greece', 'Hong Kong', 'Hungary', 'Iceland', 'India', 'Iran',
       'Ireland', 'Israel', 'Italy', 'Japan', 'Lebanon', 'Lithuania',
       'Malaysia', 'Mexico', 'Netherlands', 'New Zealand', 'Norway', 'Poland',
       'Portugal', 'Puerto Rico', 'Romania', 'Russia', 'Saudi Arabia',
       'Serbia', 'Singapore', 'Slovak Republic', 'Slovenia', 'South Africa',
       'South Korea', 'Spain', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand',
       'Turkey', 'USA', 'Uganda', 'United Arab Emirates', 'United Kingdom',
       'Uruguay', 'All'],
      dtype='object', name='country')
MultiIndex([('mean',             'first tier'),
            ('mean', 'other top universities'),
            ('mean',            'second tier'),
            ('mean',             'third tier'),
            ('mean',                    'All'),
            ('amax',             'first tier'),
            ('amax', 'other top universities'),
            ('amax',            'second tier'),
            ('amax',             'third tier'),
            ('amax',                    'All')],
           names=[None, 'Rank_Level'])

In [ ]:
# How would we query this if we want to get the average scores of First Tier universities broken down by country?
# You do that now, please.

* Let's get weird. We can `stack` and `unstack` columns in our dataframe.
* `stack` takes pivots the lowermost column index to become the innermost row index. unstack is the inverse
* let's look back at that pivot table...

In [ ]:
new_df.head() #we want to take the tier of uni and move it to a row index, so we are stacking....

In [8]:
new_df.stack().head()

                                       mean   amax
country   Rank_Level
Argentina other top universities  44.672857  45.66
          All                     44.672857  45.66
Australia first tier              47.942500  51.61
          other top universities  44.645750  45.97
          second tier             49.242500  50.40

In [9]:
# It can get complex! You are just comparing two groups and a value (or multiple values in this case!)
# we can unstack() all the way if we want to, which means move a row index into a column index
new_df.head() #let's pivot rank_level now into the column, what shape do you think this will create?

                 mean                                                \
Rank_Level first tier other top universities second tier third tier
country
Argentina         NaN              44.672857         NaN        NaN
Australia     47.9425              44.645750     49.2425  47.285000
Austria           NaN              44.864286         NaN  47.066667
Belgium       51.8750              45.081000     49.0840  46.746667
Brazil            NaN              44.499706     49.5650        NaN

                            amax                                     \
Rank_Level        All first tier other top universities second tier
country
Argentina   44.672857        NaN                  45.66         NaN
Australia   45.825517      51.61                  45.97       50.40
Austria     45.139583        NaN                  46.29         NaN
Belgium     47.011000      52.03                  46.21       49.73
Brazil      44.781111        NaN                  46.08       49.82


Rank_Level third tier    All
country
Argentina         NaN  45.66
Australia       47.47  51.61
Austria         47.78  47.78
Belgium         47.14  52.03
Brazil            NaN  49.82

In [10]:
new_df.unstack().head(10)

      Rank_Level  country
mean  first tier  Argentina          NaN
                  Australia    47.942500
                  Austria            NaN
                  Belgium      51.875000
                  Brazil             NaN
                  Bulgaria           NaN
                  Canada       53.633846
                  Chile              NaN
                  China        53.592500
                  Colombia           NaN
dtype: float64

* Remember, you can pass any function you want to the aggregate function, including those that you define yourself!